{"class_name": "Sequential", "config": {"layers": [{"class_name": "Lambda", "config": {"arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "output_shape": null, "name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoHY29kZS5wedoIPGxhbWJkYT5UAAAAcwAAAAA=\n", null, null]}}, {"class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": true, "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activity_regularizer": null, "strides": [2, 2], "filters": 24, "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "elu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activity_regularizer": null, "strides": [2, 2], "filters": 36, "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "elu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activity_regularizer": null, "strides": [2, 2], "filters": 48, "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "elu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "elu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "elu"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 100, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "elu"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 50, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 10, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}